Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: "" is returned if the entity name is unknown.
ja: 未知のエンティティ名ならば "" が返されます。

source: "A great chef is an artist that I truly respect" -- Robert Stack.
ja: "偉大なる料理人こそ心より尊敬すべき芸術家です。" -- ロバート・スタック

source: "Abstraction is layering ignorance on top of reality." -- Richard Gabriel
ja: "抽象化とは現実の上に成り立つ無知の階層化である。" -- リチャード・ガブリエル

source: "Der Mensch ist doch ein Augentier -- schöne Dinge wünsch ich mir."
ja: "人間は視覚の動物である ― だから、ボクはキミに美しくいて欲しい。"

source: "Look at you, hacker.
ja: "おお、ハッカーよ。

source: "The road to hell is paved with good intentions."
ja: "地獄へ通ずる道は偽善者のしかばねで舗装されている。"

source: "With Great Power Comes Great Responsibility." -- Spider Man's Uncle
ja: "大いなる力には大いなる責任が伴う。" -- スパイダーマンの叔父

source: "comment": "This module is a sample."
ja: "comment": "このモジュールはサンプルです。"

source: "description": "Takes an integer and outputs as many &quot;hello world!&quot;s",
ja: "description": "&quot;hello world!&quot; の出力回数を整数で指定します。",

source: "moduleDescription": "This module is a sample",
ja: "moduleDescription": "このモジュールはサンプルです。",

source: # This is a comment.
ja: # これはコメントです。

source: # build from C sources and then using koch ./build.sh --os $os_type --cpu $cpu_arch ./bin/nim c koch ./koch boot -d:release # optionally generate docs into doc/html ./koch docs ./koch tools -d:release # extract files to be really installed ./install.sh <tempdir> # also include the tools for fn in nimble nimsuggest nimgrep; do cp ./bin/$fn <tempdir>/nim/bin/; done
ja: # C ソースと koch でビルドします ./build.sh --os $os_type --cpu $cpu_arch ./bin/nim c koch ./koch boot -d:release # オプションのドキュメントを doc/html ディレクトリへ生成します ./koch docs ./koch tools -d:release # 実際にインストールするファイルを抽出します ./install.sh <一時作業用ディレクトリ> # ツールなども対象となります for fn in nimble nimsuggest nimgrep; do cp ./bin/$fn <一時作業用ディレクトリ>/nim/bin/; done

source: # delete any htmldocs/*.idx file before starting nim doc --project --index:on --git.url:<url> --git.commit:<tag> <main_filename>.nim nim buildIndex -o:htmldocs/theindex.html htmldocs
ja: # はじめる前に htmldocs/*.idx ファイルを全て削除してください nim doc --project --index:on --git.url:<url> --git.commit:<タグ> <メインファイル名>.nim nim buildIndex -o:htmldocs/theindex.html htmldocs

source: ## (not POSIX)
ja: ## (非 POSIX)

source: ## For a shared memory object, the length in bytes.
ja: ## 共有メモリオブジェクトでは、バイト単位による長さ。

source: ## For a typed memory object, the length in bytes.
ja: ## 型付きオブジェクトでは、バイト単位による長さ。

source: ## For other file types, the use of this field is
ja: ## 上記以外のファイルの種類では、このフィールドは

source: ## For symbolic links, the length in bytes of the
ja: ## シンボリックリンクでは、シンボリックリンク先となる

source: ## If the file does not exist, it will be
ja: ## ファイルがなければ作成します。

source: ## If the file does not exist, it will not be
ja: ## ファイルがなくても作成しません。

source: ## Name of this implementation of the operating system.
ja: ## この実装ではオペレーティング・システム名です。

source: ## On Windows, this is the default.
ja: ## Windows では、これがデフォルトです。

source: ## SIG_IGN or SIG_DFL.
ja: ## SIG_DFL マクロ。

source: ## Unix: Start the program as a daemon.
ja: ## Unix: プログラムをデーモンとして起動します。

source: ## Use it only if `command` comes from trusted source.
ja: ## 信頼できる配布元から得た `command` に限り使用してください。

source: ## alternative protocol names, terminated by
ja: ## 代替プロトコル名の

source: ## at the end.
ja: ## ファイル終端にデータを追記します。

source: ## contacting the service.
ja: ## 使うプロトコル名。

source: ## context is active.
ja: ## ブロックされるシグナルの設定です。

source: ## context.
ja: ## コンテキスト。

source: ## for this object.
ja: ## 優先 I/O ブロックサイズ。

source: ## in units of f_frsize.
ja: ## ファイルシステムの合計ブロック数。

source: ## integer signal value not defined!
ja: ## 整数シグナル値は定義しないでください！

source: ## may vary from file to file.
ja: ## これはファイル同士で変更される場合があります。

source: ## network to which this node is attached, if any.
ja: ## 通信ネットワーク上におけるこのノードの名前。

source: ## non-privileged process.
ja: ## 空きブロック数。

source: ## pathname contained in the symbolic link.
ja: ## パス名のバイト単位による長さ。

source: ## plus optional time or timezone information
ja: ## それに加えてオプションの時間または標準時間帯の情報

source: ## pointers to member names.
ja: ## NULL 終端配列のポインタ。

source: ## resides, in network byte order.
ja: ## サービスが存在するポート番号。

source: ## returned with F_GETLK.
ja: ## F_GETLK が返されます。

source: ## since the epoch ('1970-01-01 00:00:00' UTC).
ja: ## UNIX エポック時間は 1970年01月01日 午前00時00分00秒 (協定世界時) です。

source: ## string literal, etc.
ja: ## 文字列リテラルなど。

source: ## system is running.
ja: ## ハードウェアの型番名。

source: ## the document or the section
ja: ## ドキュメント、またはセクション

source: ## the signal handling function.
ja: ## 実行するシグナル処理関数の設定。

source: ## this signal, as defined in <errno.h>.
ja: ## errno 値 (<errno.h> で定義)。

source: ## unspecified.
ja: ## 未指定です。

source: ## when this context returns.
ja: ## コンテキストのポインタが返されます。

source: ## work in progress!
ja: ## 未完成です！

source: ## would have been done.
ja: ## スクリプトの処理結果を表示します。

source: 'key' has to be unique!
ja: 'key' は唯一無二のものを指定してください！

source: (0,0) is the upper left of the screen.
ja: (0,0) は画面の左上角です。

source: (1/x) Source Edit
ja: (1/x) ソース 編集

source: (A crit bit tree is a form of radix tree or patricia trie.)
ja: (crit ビットツリーの方式は基数ツリー、またはパトリシア・トライです)。

source: (Generic symbol lookup prepass.) Source Edit
ja: (Generic symbol lookup prepass.) ソース 編集

source: (In other words: Overwriting is possible.)
ja: (言い換えると: 上書き可能です)。

source: (Requires Linux kernel > 3.9) Source Edit
ja: (Linux カーネル 3.9 以降が必要です)。 ソース 編集

source: (See ^ template) Source Edit
ja: (See ^ template) ソース 編集

source: (also called Hamming weight.) Source Edit
ja: (also called Hamming weight.) ソース 編集

source: (not POSIX)
ja: (非 POSIX)

source: --NimblePath:PATH
ja: --NimblePath:パス

source: --cincludes:DIR
ja: --cincludes:ディレクトリ

source: --clib:LIBNAME
ja: --clib:ライブラリ名

source: --clibdir:DIR
ja: --clibdir:ディレクトリ

source: --cpu:SYMBOL
ja: --cpu:シンボル

source: --dynlibOverride:SYMBOL
ja: --dynlibOverride:シンボル

source: --excludePath:PATH
ja: --excludePath:パス

source: --expandMacro:MACRO
ja: --expandMacro:マクロ

source: --ext:EX1|EX2|...
ja: --ext:拡張子１|拡張子２|...

source: --os:SYMBOL
ja: --os:シンボル

source: --putenv:key=value
ja: --putenv:キー=値

source: -d, --define:SYMBOL(:VAL)
ja: -d, --define:シンボル(:値)

source: -l, --passL:OPTION
ja: -l, --passL:オプション

source: -p, --path:PATH
ja: -p, --path:パス

source: -t, --passC:OPTION
ja: -t, --passC:オプション

source: -u, --undef:SYMBOL
ja: -u, --undef:シンボル

source: / proc
ja: / プロシージャ

source: /../ proc
ja: /../ プロシージャ

source: // code }
ja: // コード }

source: 0 (lowest)
ja: 0 (最低)

source: 0 iff a == b
ja: もし a == b ならば 0

source: 0 iff pathA == pathB
ja: もし pathA == pathB ならば 0

source: 10 (highest)
ja: 10 (最高)

source: 255, char] ## Name of entry.
ja: 255, char] ## エントリ名。

source: 256 threads should be good enough for anybody ;-) Source Edit
ja: 256 threads should be good enough for anybody ;-) ソース 編集

source: 5*256=1280 Normal+Shift+Ctrl+Alt+Sys Source Edit
ja: 5*256=1280 Normal+Shift+Ctrl+Alt+Sys ソース 編集

source: 92 - 1, char] ## Socket path
ja: 92 - 1, char] ## ソケットのパス

source: ; This config file holds configuration information about the Nim compiler ; and project.
ja: ; このコンフィギュレーション・ファイルには Nim コンパイラと ; プロジェクトに関する情報があります。

source: ; this too.
ja: ; これもコメントです。

source: < 0 iff a < b
ja: もし a < b ならば 0 以下

source: < 0 iff pathA < pathB
ja: もし pathA < pathB ならば 0 以下

source: <> macro
ja: <> マクロ

source: <a href="http://nim-lang.org">Nim rules.</a>
ja: <a href="http://nim-lang.org">Nim のルール。</a>

source: $ proc for converting MD5Digest to string
ja: $ プロシージャ は MD5Digest を文字列へ変換します。

source: Compiler user guide
ja: コンパイラのユーザガイド

source: Documentation generator
ja: ドキュメンテーションジェネレータ

source: GC
ja: ガベージコレクター

source: Hot code reloading
ja: ホットコード・リローディング

source: Index
ja: 索引

source: Internal documentation
ja: コンパイラの内部構造

source: Language Manual
ja: 言語マニュアル

source: Library documentation
ja: 標準ライブラリのドキュメンテーション

source: MathML is supported, MathML is part of HTML5.
ja: HTML5 の機能として MathML をサポートしています。

source: Nimsuggest for IDE support
ja: Nimsuggest の IDE サポート

source: Source code filters
ja: ソースコードフィルタ

source: Source Edit
ja: ソース 編集

source: Tools documentation
ja: ツールのドキュメント

source: Tutorial (part I)
ja: チュートリアル（第１部）

source: Tutorial (part II)
ja: チュートリアル（第２部）

source: Tutorial (part III)
ja: チュートリアル（第３部）

source: algorithm Implements some common generic algorithms like sort or binary search.
ja: algorithm にはソートやバイナリサーチなど一般的に良く使われるアルゴリズムを実装してあります。

source: asyncfile This module implements asynchronous file reading and writing using asyncdispatch.
ja: asyncfile このモジュールは asyncdispatch を用いた非同期によるファイル読み書き機能の実装です。

source: asyncftpclient This module implements an asynchronous FTP client using the asyncnet module.
ja: asyncftpclient このモジュールは asyncnet モジュールを用いた非同期による FTP クライアントの実装です。

source: asynchttpserver This module implements an asynchronous HTTP server using the asyncnet module.
ja: asynchttpserver このモジュールは asyncnet モジュールを用いた非同期による HTTP サーバの実装です。

source: asyncnet This module implements asynchronous sockets based on the asyncdispatch module.
ja: asyncnet このモジュールは asyncdispatch モジュールをベースにした非同期によるソケットの実装です。

source: attr proc for finding an attribute
ja: attr プロシージャ は属性を検索します

source: attrs proc for XmlAttributes getter
ja: attrs プロシージャ は XmlAttributes の getter です

source: attrs= proc for XmlAttributes setter
ja: attrs= プロシージャ は XmlAttributes の setter です

source: attrsLen proc for number of attributes
ja: attrsLen プロシージャ は 属性の個数を返します

source: base64 module implements a base64 encoder and decoder
ja: base64 モジュール は Base64 エンコーダーとデコーダーの実装

source: base64 This module implements a base64 encoder and decoder.
ja: base64 このモジュールは Base64 エンコーダーとデコーダーの実装です。

source: bitops Provides a series of low level methods for bit manipulation.
ja: bitops ビット操作で使う低水準メソッド集の実装です。

source: browsers This module implements procs for opening URLs with the user's default browser.
ja: browsers このモジュールはユーザのデフォルトブラウザで URL を開くプロシージャの実装です。

source: cgi This module implements helpers for CGI applications.
ja: cgi このモジュールは CGI アプリケーションに関する補助機能の実装です。

source: channels Nim message passing support for threads.
ja: channels スレッドにおける Nim のメッセージ・パッシング機能です。

source: colors This module implements color handling for Nim.
ja: colors このモジュールは Nim で使えるカラー処理の実装です。

source: cpuinfo This module implements procs to determine the number of CPUs / cores.
ja: cpuinfo このモジュールは CPU / コア数を判定するプロシージャの実装です。

source: cstrutils Utilities for cstring handling.
ja: cstrutils cstring 処理用ユーティリティ。

source: db_mysql module for MySQL database wrapper
ja: db_mysql モジュールは MySQL データベースのラッパーです。

source: db_mysql A higher level MySQL database wrapper.
ja: db_mysql 高水準 MySQL データベースのラッパーです。

source: db_odbc module for ODBC database wrapper
ja: db_odbc モジュールは ODBC データベースのラッパーです。

source: db_postgres module for PostgreSQL database wrapper
ja: db_postgres モジュールは PostgreSQL データベースのラッパーです。

source: db_postgres A higher level PostgreSQL database wrapper.
ja: db_postgres 高水準 PostgreSQL データベースのラッパーです。

source: db_sqlite A higher level SQLite database wrapper.
ja: db_sqlite 高水準 SQLite データベースのラッパーです。

source: decode proc for decoding a string
ja: decode プロシージャ は文字列のデコードをします

source: distros This module implements the basics for OS distribution ("distro") detection and the OS's native package manager.
ja: distros このモジュールは OS ディストリビューション ("ディストロ") の検出、および OS ネイティブのパッケージマネージャで使う基盤技術の実装です。

source: dom Declaration of the Document Object Model for the JS backend.
ja: dom JavaScript バックエンド で使えるドキュメント・オブジェクト・モデル (DOM: Document Object Model) の宣言です。

source: doubly linked rings (circular lists)
ja: 双方向連結リング (環状リスト)

source: dynlib This module implements the ability to access symbols from shared libraries.
ja: dynlib このモジュールは共有ライブラリからシンボルへアクセスする機能の実装です。

source: encode proc for encoding a string
ja: encode プロシージャ は文字列のエンコードをします

source: encode proc for encoding an openarray
ja: encode プロシージャ は無蓋配列のエンコードをします

source: encodings Converts between different character encodings.
ja: encodings 異種文字エンコーディング間での変換を行います。

source: endians This module contains helpers that deal with different byte orders.
ja: endians このモジュールは異種バイトオーダーの処理に用いる補助機能の実装です。

source: getMD5 proc which returns a string representation of the MD5Digest
ja: getMD5 プロシージャ は MD5Digest を文字列形式で返します。

source: hashes module for efficient computations of hash values for diverse Nim types
ja: hashes モジュール は様々な Nim 型で使える効率的なハッシュ値の算出方法

source: hashes This module implements efficient computations of hash values for diverse Nim types.
ja: hashes このモジュールは様々な Nim 型で使える効率的なハッシュ値の算出方法です。

source: htmlgen module for html code generator
ja: htmlgen モジュール は html コードジェネレータです

source: htmlgen This module implements a simple XML and HTML code generator.
ja: htmlgen このモジュールはシンプルな XML と HTML のコードジェネレータの実装です。

source: htmlparser This module parses an HTML document and creates its XML tree representation.
ja: htmlparser このモジュールは XML ドキュメントの構文解析と XML ツリー表現を作成します。

source: https://developer.mozilla.org/docs/Web/API/Console/clear Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/clear ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/count Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/count ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/countReset Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/countReset ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/debug Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/debug ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/error Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/error ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/group Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/group ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/groupEnd Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/groupEnd ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/info Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/info ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/log Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/log ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/table Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/table ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/time Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/time ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/timeEnd Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/timeEnd ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/timeLog Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/timeLog ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/trace Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/trace ソース 編集

source: https://developer.mozilla.org/docs/Web/API/Console/warn Source Edit
ja: https://developer.mozilla.org/docs/Web/API/Console/warn ソース 編集

source: https://developer.mozilla.org/en-US/docs/Web/API/Console/groupCollapsed Source Edit
ja: https://developer.mozilla.org/en-US/docs/Web/API/Console/groupCollapsed ソース 編集

source: instantRows iterator example code
ja: instantRows イテレータにはコードの用例があります

source: iup Wrapper of the IUP GUI library.
ja: iup GUI ライブラリである IUP のラッパーです。

source: jscore Wrapper of core JavaScript functions.
ja: jscore コア JavaScript 関数のラッパーです。

source: locks Locks and condition variables for Nim.
ja: locks Nim におけるロックと状態変数です。

source: macros Contains the AST API and documentation of Nim for writing macros.
ja: macros マクロの記述に関する Nim の抽象構文木 (AST) API とドキュメンテーションがあります。

source: marshal Contains procs for serialization and deseralization of arbitrary Nim data structures.
ja: marshal このモジュールは任意 Nim データ構造のシリアライゼーション (serialization)、およびデシリアライゼーション (deserialization) で使えるプロシージャです。

source: md5 module implements the MD5 checksum algorithm
ja: md5 モジュール MD5 チェックサム・アルゴリズムの実装

source: md5 This module implements the MD5 checksum algorithm.
ja: md5 このモジュールは MD5 チェックサム・アルゴリズムの実装です。

source: mersenne Mersenne twister random number generator.
ja: mersenne メルセンヌ・ツイスター法による乱数生成器です。

source: mimetypes This module implements a mimetypes database.
ja: mimetypes このモジュールは mimetypes データベースの実装です。

source: mysql Contains a wrapper for the mySQL API.
ja: mysql mySQL API のラッパーです。

source: newStringStream proc creates a new stream from string.
ja: newStringStream プロシージャ は新しいストリームを文字列から作成します。

source: odbcsql interface to the ODBC driver.
ja: odbcsql ODBC ドライバのインタフェースです。

source: oids An OID is a global ID that consists of a timestamp, a unique counter and a random value.
ja: oids オブジェクト ID (OID) はタイムスタンプ、固有カウンタ、乱数値から構成されるグローバル ID です。

source: openssl Wrapper for OpenSSL.
ja: openssl OpenSSL のラッパーです。

source: os Basic operating system facilities like retrieving environment variables, reading command line arguments, working with directories, running shell commands, etc.
ja: os 環境変数の取得、コマンドライン引数の読み取り、ディレクトリ管理、シェルコマンドの実行などの基本的なオペレーティング・システムの機能です。

source: packages/docutils/highlite Source highlighter for programming or markup languages.
ja: packages/docutils/highlite プログラミング言語、またはマークアップ言語用のソースハイライターです。

source: packages/docutils/rst This module implements a reStructuredText parser.
ja: packages/docutils/rst このモジュールは reStructuredText パーサーの実装です。

source: packages/docutils/rstast This module implements an AST for the reStructuredText parser.
ja: packages/docutils/rstast このモジュールは reStructuredText パーサーにおける抽象構文木 (AST) の実装です。

source: packages/docutils/rstgen This module implements a generator of HTML/Latex from reStructuredText.
ja: packages/docutils/rstgen このモジュールは reStructuredText から HTML/LaTeX へ変換するジェネレータの実装です。

source: parseSecureHash proc for converting a string hash to SecureHash
ja: parseSecureHash プロシージャ は文字列 hash を SecureHash へ変換します

source: parsexml module for low-level XML parsing
ja: parsexml モジュール は低水準の XML 構文解析器です

source: pcre Wrapper for the PCRE library.
ja: pcre PCRE ライブラリのラッパーです。

source: posix Contains a wrapper for the POSIX standard.
ja: posix POSIX 標準規格のラッパーです。

source: posix_utils Contains helpers for the POSIX standard or specialized for Linux and BSDs.
ja: posix_utils POSIX 標準規格、または Linux と BSD 専用の補助機能です。

source: postgres Contains a wrapper for the PostgreSQL API.
ja: postgres PostgreSQL API のラッパーです。

source: punycode Implements a representation of Unicode with the limited ASCII character subset.
ja: punycode ASCII 文字の部分集合に限定した Unicode 形式の実装です。

source: random Fast and tiny random number generator.
ja: random 速くて小さい乱数生成器です。

source: re This module contains procedures and operators for handling regular expressions.
ja: re このモジュールには正規表現処理のプロシージャと演算子があります。

source: registry Windows registry support.
ja: registry Windows レジストリのサポートです。

source: rlocks Reentrant locks for Nim.
ja: rlocks Nim における再入可能ロック (Reentrant lock) のサポートです。

source: secureHash proc for generating a SecureHash from a string
ja: secureHash プロシージャ は文字列から SecureHash を生成します

source: secureHashFile proc for generating a SecureHash from a file
ja: secureHashFile プロシージャ はファイルから SecureHash を生成します

source: sequtils module for working with the built-in seq type
ja: sequtils モジュール for working with the built-in seq type

source: sha1 module implements a sha1 encoder and decoder
ja: sha1 モジュール SHA1 エンコーダーとデコーダーの実装

source: singly linked rings (circular lists)
ja: 単方向連結リング (環状リスト)

source: smtp This module implement a simple SMTP client.
ja: smtp このモジュールはシンプルな SMTP クライアントの実装です。

source: sqlite3 Contains a wrapper for SQLite 3 API.
ja: sqlite3 SQLite 3 API のラッパーです。

source: std/editdistance This module contains an algorithm to compute the edit distance between two Unicode strings.
ja: std/editdistance このモジュールは二区間にある Unicode 文字列の編集距離を求めるためのアルゴリズムを収録しています。

source: std/sha1 module for a sha1 encoder and decoder
ja: std/sha1 モジュール は SHA1 エンコーダーとデコーダーの実装

source: std/sha1 This module implements a sha1 encoder and decoder.
ja: std/sha1 このモジュールは sha1 エンコーダーとデコーダーの実装です。

source: std/sums Fast sumation functions.
ja: std/sums 高速処理による総和関数です。

source: std/varints Decode variable length integers that are compatible with SQLite.
ja: std/varints SQLite と互換性のある可変長整数をデコードします。

source: std/wordwrap This module contains an algorithm to wordwrap a Unicode string.
ja: std/wordwrap このモジュールは Unicode 文字列で使えるワードラップ・アルゴリズムの実装です。

source: system Basic procs and operators that every program needs.
ja: system すべてのプログラムで必要とされる基本的なプロシージャと演算子です。

source: tables module for sorting tables
ja: tables モジュール はテーブルをソートします

source: tag proc for tag getter
ja: tag プロシージャ は tag の getter です

source: tag= proc for tag setter
ja: tag= プロシージャ は tag の setter です

source: text proc for text getter
ja: text プロシージャ は text の getter です

source: text= proc for text setter
ja: text= プロシージャ は text の setter です

source: threads Basic Nim thread support.
ja: threads Nim の基本的なスレッド機能です。

source: toMD5 proc which returns the MD5Digest of a string
ja: toMD5 プロシージャ は文字列の MD5Digest を返します

source: typeinfo Provides (unsafe) access to Nim's run time type information.
ja: typeinfo Nim の実行時型情報への (安全でない) アクセス機構です。

source: typetraits This module defines compile-time reflection procs for working with types.
ja: typetraits このモジュールは型機能によるコンパイル時リフレクション処理用のプロシージャ定義です。

source: unidecode It provides a single proc that does Unicode to ASCII transliterations.
ja: unidecode Unicode から ASCII へ翻字を行うプロシージャです。

source: unittest Implements a Unit testing DSL.
ja: unittest ユニットテストで使うドメイン特化言語 (DSL) の実装です。

source: volatile This module contains code for generating volatile loads and stores, which are useful in embedded and systems programming.
ja: volatile このモジュールは組み込み機器とシステム・プログラミングで便利な volatile のロードと格納処理を生成するコードがあります。

source: winlean Contains a wrapper for a small subset of the Win32 API.
ja: winlean Windows API の小規模ラッパーです。

source: xmlparser module for high-level XML parsing
ja: xmlparser モジュール は高水準の XML 構文解析器です

source: xmlparser This module parses an XML document and creates its XML tree representation.
ja: xmlparser このモジュールは XML ドキュメントの構文解析と XML ツリー表現を作成します。

source: xmltree A simple XML tree.
ja: xmltree シンプルな XML ツリーです。

source: MathML is an Standard ISO/IEC 40314 from year 2015.
ja: MathML は 2015 年に制定された ISO/IEC 40314 の標準規格です。

source: Deprecated: Deprecated since v0.20.0: use 'clear' instead.
ja: 廃止: v0.20.0 以降で廃止: 'clear' をお使いください。

source: Deprecated: Deprecated since v0.20.0: use 'initHeapQueue' instead.
ja: 廃止: v0.20.0 以降で廃止: 'initHeapQueue' をお使いください。

source: Deprecated: argument `len` should be of type `csize_t`
ja: 廃止: 引数 `len` は `csize_t` 型にしてください

source: Deprecated: import os.nim instead
ja: 廃止: os.nim をインポートしてください。

source: Deprecated: use 'init' instead
ja: 廃止: 'init' をお使いください。

source: Deprecated: use distinctBase from typetraits instead
ja: 廃止: typetraits モジュールの distinctBase をお使いください

source: Deprecated: use readLines with two arguments
ja: 廃止: readLines に引数を二つ指定してください。

source: Note: The Karax project (nimble install karax) has a better way to achieve the same, see https://github.com/pragmagic/karax/blob/master/tests/nativehtmlgen.nim for an example.
ja: 備考: このモジュールよりも Karax プロジェクト (nimble install karax) のほうが優れています。用例は https://github.com/pragmagic/karax/blob/master/tests/nativehtmlgen.nim を参照してください。

source: Note: This list is incomplete, in doubt dom96 is responsible for the standard library, araq is responsible for the compiler.
ja: 備考: このリストは未完成です。標準ライブラリの責務 は dom96 にあるか疑問ですが、コンパイラの責務は araq にあります。

source: assignment operator (like +=, *=)
ja: 代入演算子 (+=, *= など)
